#---------------------------------------------------------#
#                       ⬆️以下内容勿动❕
#---------------------------------------------------------#
import threading
import time
import 轻任务
import 天生自由派
#---------------------------------------------------------#
#                       ⬆️以上内容勿动❕
#---------------------------------------------------------#





活动名 = 天生自由派
所有账号Cookie = {
            "许中亦":"这里替换你的cookie值",
            "章若楠":"这里替换你的cookie值",
            "名扬海":"这里替换你的cookie值",
            }
#修改你成自己的Cookie
#账号Cookie = {
#           "账号名称1":"这里输入你的cookie值"
#           "账号名称2":"这里输入你的cookie值"
#           } 
#可以多账号执行
#注意⚠️结尾的 " 双引号和 } 打大括号（使用英文输入）

mission = "1709"
视频数量requirement = "3630189452809594562"
主页时间requirement = "3630154268437505730"
话题时间requirement = "3630083899693328066"
主页author = "101873038474"
话题topic = "1724894125742088"


#---------------------------------------------------------#
#                       ⬆️以下内容勿动❕
#---------------------------------------------------------#
def 所有账号刷主页时间(次数):
    for cookie值 in 所有账号Cookie:
        轻任务.账号Cookie["Cookie"] = 所有账号Cookie[cookie值]
        print("正在为"+cookie值+"刷主页时间")
        # print(账号Cookie) 
        轻任务.刷主页时间1(活动名,次数)

def 所有账号刷视频数量(次数):
    for cookie值 in 所有账号Cookie:
        轻任务.账号Cookie["Cookie"] = 所有账号Cookie[cookie值]
        print("正在为"+cookie值+"刷视频数量")
        # print(账号Cookie) 
        轻任务.刷视频数量2(活动名,次数)

def 所有账号刷话题时间(次数):
    for cookie值 in 所有账号Cookie:
        轻任务.账号Cookie["Cookie"] = 所有账号Cookie[cookie值]
        print("正在为"+cookie值+"刷话题时间")
        # print(账号Cookie) 
        轻任务.刷话题时间3(活动名,次数)
#---------------------------------------------------------#
#                       ⬆️以上内容勿动❕
#---------------------------------------------------------#





if __name__ == '__main__':
    所有账号刷主页时间(0)
    所有账号刷视频数量(0)
    所有账号刷话题时间(0)

#修改()括号里的次数为你需要刷多少次时间（1/1次）（0/0次）
